perf/load_testing/results/ping_results.txt

> perf@1.0.0 artillery
> artillery run load_testing/ping.yaml -e app

Phase started: WarmUp (index: 0, duration: 30s) 23:43:18(-0300)

--------------------------------------
Metrics for period to: 23:43:20(-0300) (width: 0.023s)
--------------------------------------

http.codes.200: ................................................................ 5
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 5
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 3
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 5
vusers.completed: .............................................................. 5
vusers.created: ................................................................ 5
vusers.created_by_name.Ping (/ping): ........................................... 5
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.4
  max: ......................................................................... 22
  median: ...................................................................... 21.1
  p95: ......................................................................... 22
  p99: ......................................................................... 22


--------------------------------------
Metrics for period to: 23:43:30(-0300) (width: 9.005s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.2
  max: ......................................................................... 6.2
  median: ...................................................................... 3.9
  p95: ......................................................................... 4.7
  p99: ......................................................................... 6


Phase completed: WarmUp (index: 0, duration: 30s) 23:43:48(-0300)

Phase started: Ramp (index: 1, duration: 30s) 23:43:48(-0300)

--------------------------------------
Metrics for period to: 23:43:40(-0300) (width: 9.004s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 4.2
  median: ...................................................................... 3.5
  p95: ......................................................................... 3.9
  p99: ......................................................................... 4.1


--------------------------------------
Metrics for period to: 23:43:50(-0300) (width: 9.774s)
--------------------------------------

http.codes.200: ................................................................ 66
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 66
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 66
vusers.completed: .............................................................. 66
vusers.created: ................................................................ 66
vusers.created_by_name.Ping (/ping): ........................................... 66
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 20.2
  median: ...................................................................... 3.4
  p95: ......................................................................... 4.4
  p99: ......................................................................... 19.9


--------------------------------------
Metrics for period to: 23:44:00(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 171
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 171
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 171
vusers.completed: .............................................................. 171
vusers.created: ................................................................ 171
vusers.created_by_name.Ping (/ping): ........................................... 171
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.7
  max: ......................................................................... 20.7
  median: ...................................................................... 2.7
  p95: ......................................................................... 3.8
  p99: ......................................................................... 18.7


Phase completed: Ramp (index: 1, duration: 30s) 23:44:19(-0300)

Phase started: Plain (index: 2, duration: 120s) 23:44:19(-0300)

--------------------------------------
Metrics for period to: 23:44:10(-0300) (width: 9.953s)
--------------------------------------

http.codes.200: ................................................................ 332
http.request_rate: ............................................................. 35/sec
http.requests: ................................................................. 332
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 332
vusers.completed: .............................................................. 332
vusers.created: ................................................................ 332
vusers.created_by_name.Ping (/ping): ........................................... 332
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 8.6
  median: ...................................................................... 2.7
  p95: ......................................................................... 3.9
  p99: ......................................................................... 5.4


--------------------------------------
Metrics for period to: 23:44:20(-0300) (width: 9.956s)
--------------------------------------

http.codes.200: ................................................................ 464
http.request_rate: ............................................................. 49/sec
http.requests: ................................................................. 464
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 31
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 464
vusers.completed: .............................................................. 464
vusers.created: ................................................................ 464
vusers.created_by_name.Ping (/ping): ........................................... 464
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.9
  max: ......................................................................... 33.1
  median: ...................................................................... 3.1
  p95: ......................................................................... 5.2
  p99: ......................................................................... 21.5


--------------------------------------
Metrics for period to: 23:44:30(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 5
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 7.8
  median: ...................................................................... 3.6
  p95: ......................................................................... 6.4
  p99: ......................................................................... 7.3


--------------------------------------
Metrics for period to: 23:44:40(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 6
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 8.6
  median: ...................................................................... 3.5
  p95: ......................................................................... 6.1
  p99: ......................................................................... 7


--------------------------------------
Metrics for period to: 23:44:50(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 7.5
  median: ...................................................................... 3.5
  p95: ......................................................................... 5.6
  p99: ......................................................................... 6.6


--------------------------------------
Metrics for period to: 23:45:00(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 7.2
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.6
  p99: ......................................................................... 6.5


--------------------------------------
Metrics for period to: 23:45:10(-0300) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 7.3
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.9
  p99: ......................................................................... 6.6


--------------------------------------
Metrics for period to: 23:45:20(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 7
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.5
  p99: ......................................................................... 6.2


--------------------------------------
Metrics for period to: 23:45:30(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 8.3
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.8
  p99: ......................................................................... 6.5


--------------------------------------
Metrics for period to: 23:45:40(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 6
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 7.5
  median: ...................................................................... 3.3
  p95: ......................................................................... 5.9
  p99: ......................................................................... 6.8


--------------------------------------
Metrics for period to: 23:45:50(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 6.6
  median: ...................................................................... 3.1
  p95: ......................................................................... 5.4
  p99: ......................................................................... 6


--------------------------------------
Metrics for period to: 23:46:00(-0300) (width: 9.954s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 7
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.9
  p99: ......................................................................... 6.6


Phase completed: Plain (index: 2, duration: 120s) 23:46:19(-0300)

Phase started: CoolDown (index: 3, duration: 30s) 23:46:19(-0300)

--------------------------------------
Metrics for period to: 23:46:10(-0300) (width: 9.955s)
--------------------------------------

http.codes.200: ................................................................ 500
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 500
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 500
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Ping (/ping): ........................................... 500
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 7.6
  median: ...................................................................... 3.4
  p95: ......................................................................... 6
  p99: ......................................................................... 6.9


--------------------------------------
Metrics for period to: 23:46:20(-0300) (width: 9.208s)
--------------------------------------

http.codes.200: ................................................................ 467
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 467
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 5
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 467
vusers.completed: .............................................................. 467
vusers.created: ................................................................ 467
vusers.created_by_name.Ping (/ping): ........................................... 467
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 8.9
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.9
  p99: ......................................................................... 7.3


--------------------------------------
Metrics for period to: 23:46:30(-0300) (width: 9.004s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 3.6
  median: ...................................................................... 3.2
  p95: ......................................................................... 3.5
  p99: ......................................................................... 3.6


Phase completed: CoolDown (index: 3, duration: 30s) 23:46:49(-0300)

--------------------------------------
Metrics for period to: 23:46:40(-0300) (width: 9.003s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 3.7
  median: ...................................................................... 2.9
  p95: ......................................................................... 3.4
  p99: ......................................................................... 3.6


--------------------------------------
Metrics for period to: 23:46:50(-0300) (width: 9.004s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.Ping (/ping): ........................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 3.6
  median: ...................................................................... 2.9
  p95: ......................................................................... 3.4
  p99: ......................................................................... 3.6


All VUs finished. Total time: 3 minutes, 32 seconds

--------------------------------
Summary report @ 23:46:50(-0300)
--------------------------------

http.codes.200: ................................................................ 3791
http.request_rate: ............................................................. 19/sec
http.requests: ................................................................. 3791
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 31
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 3791
vusers.completed: .............................................................. 3791
vusers.created: ................................................................ 3791
vusers.created_by_name.Ping (/ping): ........................................... 3791
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1.6
  max: ......................................................................... 33
  median: ...................................................................... 3.4
  p95: ......................................................................... 5.8
  p99: ......................................................................... 6.9